## [sandbox](https://my-first-env.app.spacelift.io/stack/sandbox/run/01HASTRV89613PXFP9KEJ3MP1Z) plan logs

<details>
<summary>Click here to expand</summary>

```
[01HASEX6J020HFXCSW4R0G10RE] Planning changes with 0 custom hooks...
spacelift_stack.mercedez-benz: Refreshing state... [id=mercedes-benz]
spacelift_blueprint.test-blueprint: Refreshing state... [id=test-blueprint]
random_string.test-2: Refreshing state... [id=>E->8aEx9=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # spacelift_stack.test will be created
  + resource "spacelift_stack" "test" {
      + administrative                   = false
      + autodeploy                       = false
      + autoretry                        = false
      + aws_assume_role_policy_statement = (known after apply)
      + branch                           = "main"
      + enable_local_preview             = false
      + github_action_deploy             = true
      + id                               = (known after apply)
      + manage_state                     = true
      + name                             = "mercedes-benz"
      + project_root                     = "mercedes"
      + protect_from_deletion            = false
      + repository                       = "sandbox"
      + slug                             = (known after apply)
      + space_id                         = (known after apply)
      + terraform_external_state_access  = false
      + terraform_smart_sanitization     = false
      + terraform_version                = "1.3.10"

      + github_enterprise {
          + namespace = "jubranNassar"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

[01HASEX6J020HFXCSW4R0G10RE] Changes are GO
[01HASEX6J020HFXCSW4R0G10RE] Uploading the list of managed resources...
[01HASEX6J020HFXCSW4R0G10RE] Please be aware that Run changes calculation includes Terraform output changes.
[01HASEX6J020HFXCSW4R0G10RE] Resource list upload is GO
[01HASEX6J020HFXCSW4R0G10RE] Generating JSON representation of the plan...
[01HASEX6J020HFXCSW4R0G10RE] JSON representation is GO
[01HASEX6J020HFXCSW4R0G10RE] Loading custom plan policy inputs...
[01HASEX6J020HFXCSW4R0G10RE] 0 custom plan policy inputs found
[01HASEX6J020HFXCSW4R0G10RE] No plan policies to evaluate
```

</details>